#+title: STRUCTURES AND INTERPRETATIONS OF COMPUTER PROGRAMS NOTES

** Higher Order Functions
#+begin_src lisp
(defun cube (n)
  (* n n n))
(defun sum-integers (n1 n2)
  (if (> n1 n2)
      0
      (+ n1 (sum-integers (1+ n1) n2))))
(defun sum-cubes (n1 n2)
  (if (> n1 n2)
      0
      (+ (cube n1) (sum-cubes (1+ n1) n2))))
(defun pi-sum (n1 n2)
  (if (> n1 n2)
      0
      (+ (/ 1.0 (* n1 (+ n1 2))) (pi-sum (+ n1 4) n2))))

(defun sum (term n1 next n2)
  (if (> n1 n2)
      0
      (+ (funcall term n1)
         (sum term (funcall next n1) next n2))))

(defun increment (n)
  (+ n 1))

(defun higher-sum-cubes (n1 n2)
  (sum #'cube n1 #'increment n2))

(defun ident (x) x)
(defun higher-sum-integers (n1 n2)
  (sum #'ident n1 #'increment n2))

(defun higher-pi-sum (n1 n2)
  (flet ((pi-term (n)
           (/ 1.0 (* n (+ n 2))))
         (pi-next (n)
           (+ n 4)))
    (sum #'pi-term n1 #'pi-next n2)))

(* 8 (higher-pi-sum 1 10000))

(defun integral (f a b dx)
  (flet ((add-dx (x) (+ x dx)))
    (* (sum f (+ a (/ dx 2.0)) #'add-dx b)
       dx)))

(integral #'cube 0 1 0.001)
#+end_src

#+RESULTS:
: 0.24999388

#+begin_src lisp
(defun cube (n) (* n n n))
(defun increment (n) (1+ n))
(defun sum (term n1 next n2)
  (labels ((_sum (n1 result)
             (if (> n1 n2)
                 result
                 (_sum (funcall next n1) (+ (funcall term n1) result)))))
    (_sum n1 0)))
(defun higher-sum-cubes-iter (n1 n2)
  (sum #'cube n1 #'increment n2))
(higher-sum-cubes-iter 1 10)
#+end_src

#+RESULTS:
: 3025

#+begin_src lisp
(defun ident (x) x)
(defun increment (x) (1+ x))
(defun higher-factorial (n)
  (product #'ident 1 #'increment n))

(defun accumulate (combiner null-value term n1 next n2)
  (labels ((_accumulate (n1 result)
             (if (> n1 n2)
                 result
                 (_accumulate (funcall next n1)
                              (funcall combiner (funcall term n1) result)))))
    (_accumulate n1 null-value)))

(defun filtered-accumulate (combiner null-value term n1 next n2 filter)
  (labels ((_accumulate (n1 result)
             (if (> n1 n2)
                 (remove-if-not filter result)
                 (_accumulate (funcall next n1)
                              (funcall combiner (funcall term n1) result)))))
    (_accumulate n1 null-value)))

;; TODO recursive version of accumulate

(defun sky-high-sum (term n1 next n2)
  (accumulate #'+ 0 term n1 next n2))

(sky-high-sum #'ident 1 #'increment 10)

(defun close-enough-p (x y)
  (< (abs (- x y)) 0.001))

(defun positive-p (n)
  (> n 0))
(defun negative-p (n)
  (< n 0))
(defun average (n1 n2) (/ (+ n1 n2) 2))
(defun cube (n) (* n n n))

(defun fixed-point-search (fun neg-point pos-point)
  (let ((mid-point (average neg-point pos-point)))
    (if (close-enough-p neg-point pos-point)
        mid-point
        (let ((test-value (funcall fun mid-point)))
          (cond
            ((positive-p test-value)
             (fixed-point-search fun neg-point mid-point))
            ((negative-p test-value)
             (fixed-point-search fun mid-point pos-point))
            (t mid-point))))))

(defun half-interval-method (fun n1 n2)
  (let ((n1-value (funcall fun n1))
        (n2-value (funcall fun n2)))
    (cond ((and (negative-p n1-value)
                (positive-p n2-value))
           (fixed-point-search fun n1 n2))
          ((and (negative-p n2-value)
                (positive-p n1-value))
           (fixed-point-search fun n2 n1))
          (t (error "Values ~a and ~a are not of opposite signs." n1 n2)))))

(defparameter *tolerance* 0.00001)

(defun fixed-point (fun first-guess)
  (labels ((close-enough-p (v1 v2)
             (< (abs (- v1 v2)) *tolerance*))
           (try (guess)
             (let ((next-guess (funcall fun guess)))
               (if (close-enough-p guess next-guess)
                   next-guess
                   (try (print next-guess))))))
    (try first-guess)))

(fixed-point #'cos 1.0)
(fixed-point #'(lambda (y) (+ (sin y) (cos y)))
             1.0)
(defun fixed-sqrt (x)
  (fixed-point #'(lambda (y) (average y (/ x y))) 1.0))
(fixed-sqrt 199)
#+end_src

#+RESULTS:
: 14.106736

For me, the book really begins in the higher-order functions section. The iterative vs. recursive process section is also interesting, but the exercises are too mathematical for me.

The major difference I feel between the exercises in SICP and CLGISC is that the exercises don't build on top of each other, whereas the exercises in SICP so far have often built off of each other. CLGISC does have projects that are meant to integrate the lessons learned, but SICP feels like it does that even with normal exercises.
***** LINEAR ALGEBRA OPERATIONS
We've also learned how to transpose a matrix and do some linear algebra operations on a matrix.

#+begin_src lisp
;; Exercise 2.37

(defparameter *matrix* '((1 2 3 4)
                         (4 5 6 6)
                         (6 7 8 9)))

(defparameter *vec* '(4 7 8 2))

(defun dot-product (v w)
  (reduce #'+ (mapcar #'* v w)))

(defun matrix-*-vector (m v)
  (mapcar #'(lambda (x) (dot-product x v)) m))

(defun transpose (m)
  (if (null (first m))
      nil
      (cons (mapcar #'(lambda (x) (first x)) m)
            (transpose (mapcar #'(lambda (x) (rest x)) m)))))

(defun matrix-*-matrix (m n)
  (mapcar #'(lambda (v) (matrix-*-vector (transpose n) v)) m))

(transpose *matrix*)
#+end_src

#+RESULTS:
| 1 | 4 | 6 |
| 2 | 5 | 7 |
| 3 | 6 | 8 |
| 4 | 6 | 9 |

I think that transposing will be important for creating points. I don't know if the other operations are going to be helpful for solving this exercise.
***** MATRIX USING ENUMERATE-INTERVAL
Using enumerate-interval to make a matrix,

#+begin_src lisp
(list
 (enumerate-interval 1 8)
 (enumerate-interval 1 8)
 (enumerate-interval 1 8)
 (enumerate-interval 1 8)
 (enumerate-interval 1 8)
 (enumerate-interval 1 8)
 (enumerate-interval 1 8)
 (enumerate-interval 1 8))
#+end_src

#+RESULTS:
| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |
| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |
| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |
| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |
| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |
| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |
| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |
| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |

~mapcar~ will go through each "row" of the matrix. To get the column, we can use ~transpose~.

#+begin_src lisp
(transpose (list
            (enumerate-interval 1 8)
            (enumerate-interval 1 8)
            (enumerate-interval 1 8)
            (enumerate-interval 1 8)
            (enumerate-interval 1 8)
            (enumerate-interval 1 8)
            (enumerate-interval 1 8)
            (enumerate-interval 1 8)))
#+end_src

#+RESULTS:
| 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |
| 2 | 2 | 2 | 2 | 2 | 2 | 2 | 2 |
| 3 | 3 | 3 | 3 | 3 | 3 | 3 | 3 |
| 4 | 4 | 4 | 4 | 4 | 4 | 4 | 4 |
| 5 | 5 | 5 | 5 | 5 | 5 | 5 | 5 |
| 6 | 6 | 6 | 6 | 6 | 6 | 6 | 6 |
| 7 | 7 | 7 | 7 | 7 | 7 | 7 | 7 |
| 8 | 8 | 8 | 8 | 8 | 8 | 8 | 8 |

The problem here is: How do we actually create the final matrices? How do we represent the position of the queen?

Maybe we should have a matrix of points and skip the transposing?

#+begin_src lisp
(mapcar #'(lambda (x y) (make-point x y))
        (make-matrix 8) (transpose (make-matrix 8)))
#+end_src

